app/controllers/frameworks_controller.rb

  def index
    # @frameworks = Framework.all
    @frameworks = Framework.paginate(:per_page => 5, :page => params[:page])
---
SELECT "frameworks".* FROM "frameworks" LIMIT 5 OFFSET 0

  def show
    @framework = Framework.find(params[:id])
---
SELECT "frameworks".* FROM "frameworks" WHERE "frameworks"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @framework = Framework.new(params[:framework])

    respond_to do |format|
      if @framework.save
---
INSERT INTO "frameworks" ("created_at", "description", "name", "updated_at", "version") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 09 Jul 2012 11:47:28 UTC +00:00], ["description", "The web framework called Rails"], ["name", "Rails"], ["updated_at", Mon, 09 Jul 2012 11:47:28 UTC +00:00], ["version", "3"]]