app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" LIMIT 5 OFFSET 0
---
  def index
    # @notes = Note.all
    @notes = Note.paginate(:per_page => 5, :page => params[:page])

INSERT INTO "notes" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 09 Jul 2012 11:48:22 UTC +00:00], ["description", "This is a test note"], ["updated_at", Mon, 09 Jul 2012 11:48:22 UTC +00:00]]
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save