app/controllers/sccommands_controller.rb

  def index

    @sccommands = Sccommand.search(params[:search]).paginate(:per_page => 5, :page => params[:page])
---
SELECT "sccommands".* FROM "sccommands" WHERE (commandstr or description LIKE '%testa%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "sccommands" WHERE (commandstr or description LIKE '%testa%')

  def show
    @sccommand = Sccommand.find(params[:id])
---
SELECT "sccommands".* FROM "sccommands" WHERE "sccommands"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @sccommand = Sccommand.find(params[:id])
---
SELECT "sccommands".* FROM "sccommands" WHERE "sccommands"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @sccommand = Sccommand.new(params[:sccommand])

    respond_to do |format|
      if @sccommand.save
---
INSERT INTO "sccommands" ("commandstr", "created_at", "description", "updated_at") VALUES (?, ?, ?, ?)  [["commandstr", "git push"], ["created_at", Mon, 09 Jul 2012 11:48:05 UTC +00:00], ["description", "Pushes the current repository up to git"], ["updated_at", Mon, 09 Jul 2012 11:48:05 UTC +00:00]]

  def update
    @sccommand = Sccommand.find(params[:id])

    respond_to do |format|
      if @sccommand.update_attributes(params[:sccommand])
---
SELECT "sccommands".* FROM "sccommands" WHERE "sccommands"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "sccommands" SET "commandstr" = 'The new string', "updated_at" = '2012-07-10 08:54:02.590320' WHERE "sccommands"."id" = 3