app/controllers/scerrors_controller.rb

SELECT "scerrors".* FROM "scerrors" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "scerrors"
---
  def index
    # @scerrors = Scerror.all
    @scerrors = Scerror.paginate(:per_page => 5, :page => params[:page])

SELECT "scerrors".* FROM "scerrors" WHERE "scerrors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @scerror = Scerror.find(params[:id])

INSERT INTO "scerrors" ("actualerror", "created_at", "fixnote", "framework_id", "note_id", "sccommand_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @scerror = Scerror.new(params[:scerror])

    respond_to do |format|
      if @scerror.save